#!/bin/bash

# 此文件主要用于桃谷编译的工具

if [ "$taogu_tools" ]; then
    return;
fi

export taogu_tools="taogu_tools.sh";

. log.sh

echo ">>>>>>>> include taogu_tools.sh"

function build_taogu_apk () {
	goto_build_target;
}

function goto_build_target () {
	echo -e "请选择你要编译的Androd版本:\n\n\t(0)桃谷医院专家开发版\n\t(1)桃谷医院专家正式版\n\t(2)新乡中心医院开发版\n\t(3)新乡中心医院正式版\n\t(4)商丘市一院开发版\n\t(5)商丘市一院正式版\n\t(6)桃谷医院开发版\n\t(7)桃谷医院测试版\n\t(8)唐山人民医院开发版\n\t(9)唐山人民医院正式版\n\t(10)开封市二院开发版\n\t(11)开封市二院正式版\n\t(12)博爱妇幼保健院开发版\n\t(13)博爱妇幼保健院正式版\n\t(14)安阳市中医院开发版\n\t(15)安阳市中医院正式版\n\t(16)南阳市二院开发版\n\t(17)南阳市二元正式版\n\t(18)平顶山市一院开发版\n\t(19)平顶山市医院正式版\n\t(20)驻马店市医院开发版\n\t(21)驻马店市医院正式版\n"
	read TAOGU_BUILD_TARGET;
	case $TAOGU_BUILD_TARGET in
	    0)
		i "开始编译桃谷医院专家开发版";;
	    1)
                i "开始编译桃谷医院专家正式版";; 
	    2)
		i "新乡中心医院开发版";;
	    3)
	        i "新乡中心医院正式版";;
	    4)
		i "商丘市一院开发版";;
	    5)
		i "商丘市一院正式版";;
	    6)
		i "桃谷医院开发版";;
	    7)
		i "桃谷医院测试版";;
	    8)
		i "唐山人民医院开发版";;
	    9)
	        i "唐山人民医院正式版";;
	    10)
		i "开封市二院开发版";;
	    11)
		i "开封市二院正式版";;
	    12)
		i "博爱妇幼保健院开发版";;
	    13)
                i "博爱妇幼保健院正式版";;
	    14)
		i "安阳市中医院开发版";;
	    15)
                i "安阳市中医院正式版";;
	    16)
		i "南阳市二院开发版";;
	    17)
	        i "南阳市二元正式版";;
	    18)
		i "平顶山市一院开发版";;
	    19)
		i "平顶山市医院正式版";;
	    20)
		i "驻马店市医院开发版";;
	    21)
	        i "驻马店市医院正式版";;
	    22)
		i "exit";
	esac	
}


echo "<<<<<<<< include taogu_tools.sh"
